package dummy;

import java.util.Arrays;
import java.util.Collections;
import java.util.List;

public class DummyName {
    public static String Name() {
        List<String> fName = Arrays.asList("김", "이", "박", "최", "정", "강", "조", "윤", "장", "임", "한", "오", "서", "신",
                "권", "황", "안", "송", "전", "홍", "유", "고", "문", "양", "손", "배", "조", "백", "허", "유", "남", "심", "노", "정", "하",
                "곽", "성", "차", "주", "우", "구", "신", "임", "전", "민", "유", "류", "나", "진", "지");
        List<String> lName = Arrays.asList("민준", "서준", "예준", "도윤", "시우", "주원", "하준", "지호", "지후", "준서", "준우", "현우", "도현", "지훈", "건우", "우진",
                "선우", "서진", "민재", "현준", "연우", "유준", "정우", "승우", "승현", "시윤", "준혁", "은우", "지환", "승민", "지우", "유찬",
                "윤우", "민성", "준영", "시후", "진우", "지원", "수현", "재윤", "시현", "동현", "수호", "태윤", "민규", "재원", "한결", "민우",
                "재민", "은찬", "윤호", "시원", "이준", "민찬", "지안", "시온", "성민", "준호", "승준", "성현", "이안", "현서", "재현", "하율",
                "지한", "우빈", "태민", "지성", "예성", "민호", "태현", "지율", "민혁", "서우", "성준", "은호", "규민", "정민", "준", "지민",
                "윤성", "율", "윤재", "하람", "하진", "민석", "준수", "은성", "태양", "예찬", "준희", "도훈", "하민", "준성", "건", "지완",
                "현수", "승원", "강민", "정현", "우주", "태준", "승호", "주호", "성빈", "주안", "민서", "도영", "우현", "민수", "건희", "주환",
                "하랑", "다온", "정훈", "원준", "시율", "시훈", "지오", "민기", "현민", "시완", "경민", "서율", "현성", "승윤", "주영", "동하",
                "태훈", "민건", "도율", "동건", "재훈", "태영", "호준", "승빈", "가온", "재준", "시환", "세현", "태경", "이현", "도원", "도경",
                "정후", "현진", "재영", "정원", "서후", "현승", "찬영", "라온", "영준", "상현", "범준", "윤", "온유", "승훈", "성윤", "현",
                "재하", "로운", "주혁", "찬우", "이든", "연준", "하윤", "우성", "동윤", "성훈", "승재", "찬희", "지혁", "건호", "세준", "동욱",
                "태율", "수민", "태호", "유건", "승찬", "도하", "윤찬", "단우", "태우", "산", "현호", "윤후", "현빈", "시안", "찬", "재우",
                "준석", "지운", "주현", "형준", "연호", "효준", "재혁", "성우", "규빈", "주완", "주한", "동우", "하늘", "수혁", "재희", "시헌",
                "상윤", "우찬", "유빈", "진호", "유현", "석현", "우영", "준형", "도연", "윤서", "유진", "서원", "지용", "용준", "규현", "준후",
                "서연", "서윤", "지우", "서현", "민서", "하은", "하윤", "윤서", "지유", "지민", "채원", "지윤", "은서", "수아", "다은", "예은",
                "지아", "수빈", "소율", "예린", "예원", "지원", "소윤", "지안", "하린", "시은", "유진", "채은", "윤아", "유나", "가은", "서영",
                "민지", "예진", "서아", "수민", "수연", "연우", "예나", "예서", "주아", "시연", "연서", "하율", "다인", "다연", "시아", "아인",
                "현서", "서은", "유주", "아린", "서우", "하연", "서율", "서진", "채윤", "유빈", "지율", "나윤", "수현", "예지", "다현", "소은",
                "나은", "나연", "지은", "민주", "아윤", "사랑", "시현", "예빈", "윤지", "서하", "지현", "소연", "혜원", "지수", "은채", "주하",
                "채아", "승아", "다윤", "소민", "서희", "나현", "민아", "채린", "하영", "세아", "세은", "도연", "규리", "아영", "다온", "가윤",
                "지연", "예림", "태희", "민채", "주은", "시윤", "유정", "연아", "소현", "아현", "보민", "민정", "수진", "현지", "민경", "정원",
                "나경", "가현", "세연", "은지", "윤하", "가연", "지효", "가온", "라희", "예슬", "채연", "한별", "현아", "하늘", "소희", "효주",
                "유림", "유하", "채민", "은솔", "봄", "주연", "가영", "예주", "소이", "유리", "혜린", "하진", "다희", "하랑", "하나", "태연",
                "설아", "윤슬", "은우", "하람", "다혜", "다솜", "혜인", "지혜", "유민", "재인", "승연", "다빈", "수인", "재이", "지영", "수정",
                "리아", "시온", "은유", "채영", "주원", "고은", "태린", "태은", "지후", "아라", "민하", "나영", "수지", "소영", "단아", "은별",
                "서인", "보경", "다영", "주희", "가빈", "채현", "정민", "예솔", "시우", "효린", "지온", "정윤", "소정", "라온", "은재", "세빈",
                "한나", "연재", "채이", "서빈", "예담", "슬아", "아진", "해인", "아연", "연주", "도희", "보미", "예인", "지호", "나율", "서정",
                "다원", "하음", "정연", "별", "은빈", "다율", "서원", "율", "세인", "효은", "연지", "준희", "재희", "채희", "지인", "도은",
                "은비", "다경", "리원", "채빈", "소미", "희원", "가인", "윤주", "유은", "혜민", "미소", "루아", "솔", "은수", "혜진", "은율",
                "세린", "이안", "리안", "은혜", "연수", "재은", "설", "하민", "아름", "로아", "유라", "효원", "라윤", "현진", "유이", "민영",
                "이현", "선우", "혜빈", "단비", "하온", "정현", "혜윤", "온유", "윤", "세영", "정은", "제인", "여진", "채율", "가을", "민솔",
                "윤진", "라엘", "은성", "세희", "유경", "여원", "현정", "서린", "가람", "주현", "윤채", "소원", "진서", "나린", "은설", "현주",
                "도경", "하엘", "연희", "해나", "혜림", "효민", "진아", "다정", "주영", "가희", "제이", "혜리", "라임", "소담", "하빈", "규빈",
                "지예", "지희", "태리", "수영", "효빈", "희주", "다예", "시원", "아림", "리나", "려원", "승희", "은진", "가율", "시율", "하정",
                "혜주", "시영", "윤희", "효정", "다민", "하리", "이나", "이솔", "선아", "나희", "해솔", "은아", "희진", "효진", "정인", "하경",
                "윤정", "성은", "승현", "규린", "윤솔", "영은", "새봄", "유안", "지오", "송현", "해린", "재아", "소유", "은영", "선유", "영서",
                "인서", "보영", "아율", "서이", "규림", "태이", "민선", "은하", "민희", "아정", "하임", "이서", "세현", "우리", "도윤", "도아",
                "아란", "승주", "혜나", "효림", "별하", "가원", "선영", "하늬", "수린", "예온", "예리", "시하", "담희", "도영", "희수", "정아",
                "다솔", "루리", "선율", "희연", "라은", "한비", "은정", "희서", "송연", "해원", "예람", "이수", "시안", "서경", "혜연", "라율",
                "리하", "은", "하원", "지나", "다해", "유미", "린", "유현", "예랑", "아람", "은주", "윤영", "하루", "빛나", "여은", "우주",
                "세령", "경민", "하라", "세진", "예령", "예영", "혜정", "예윤", "진", "수안", "로하", "진희", "초아", "나예", "수하", "수경",
                "누리", "아리", "진주", "인아", "태경", "민진", "나원", "윤설", "민", "보현", "인영", "이레", "하선", "성연", "승은", "태인");
        Collections.shuffle(fName);
        Collections.shuffle(lName);
        return fName.get(0) + lName.get(0);
    }

    public static void main(String[] args) {
        for (int i = 0; i < 1000; i++) {
            if (i % 10 == 0) {
                System.out.println();
            }
            System.out.print(Name() + " ");
        }
    }
}